{
"CIAccordionFoldTransition": "Transitions from one image to another of differing dimensions by unfolding and crossfading.",
"CIAdditionCompositing": "Adds color components to achieve a brightening effect.",
"CIAffineClamp": "Performs an affine transform on a source image and then clamps the pixels at the edge of the transformed image, extending them outwards.",
"CIAffineTile": "Applies an affine transform to an image and then tiles the transformed image.",
"CIAffineTransform": "Applies an affine transform to an image.",
"CIAreaAverage": "Returns a single-pixel image  that contains the average color for the region of interest.",
"CIAreaHistogram": "Returns a 1D image (inputCount wide by one pixel high) that contains the component-wise histogram computed for the specified rectangular area.",
"CIAreaMaximum": "Returns a single-pixel image that contains the maximum color components for the region of interest.",
"CIAreaMaximumAlpha": "Returns a single-pixel image that contains the color vector with the maximum alpha value for the region of interest.",
"CIAreaMinimum": "Returns a single-pixel image that contains the minimum color components for the region of interest.",
"CIAreaMinimumAlpha": "Returns a single-pixel image that contains the color vector with the minimum alpha value for the region of interest.",
"CIAztecCodeGenerator": "Generates an Aztec code (two-dimensional barcode) from input data.",
"CIBarsSwipeTransition": "Transitions from one image to another by passing a bar over the source image.",
"CIBlendWithAlphaMask": "Uses alpha values from a mask to interpolate between an image and the background.",
"CIBlendWithMask": "Uses values from a grayscale mask to interpolate between an image and the background.",
"CIBloom": "Softens edges and applies a pleasant glow to an image.",
"CIBoxBlur": "Blurs an image using a box-shaped convolution kernel.",
"CIBumpDistortion": "Creates a bump that originates at a specified point in the image.",
"CIBumpDistortionLinear": "Creates a concave or convex distortion that originates from a line in the image.",
"CICheckerboardGenerator": "Generates a checkerboard pattern.",
"CICircleSplashDistortion": "Distorts the pixels starting at the circumference of a circle and emanating outward.",
"CICircularScreen": "Simulates a circular-shaped halftone screen.",
"CICircularWrap": "Wraps an image around a transparent circle.",
"CICMYKHalftone": "Creates a color, halftoned rendition of the source image, using cyan, magenta, yellow, and black inks over a white page.",
"CICode128BarcodeGenerator": "Generates a Code 128 one-dimensional barcode from input data.",
"CIColorBlendMode": "Uses the luminance values of the background with the hue and saturation values of the source image.",
"CIColorBurnBlendMode": "Darkens the background image samples to reflect the source image samples.",
"CIColorClamp": "Modifies color values to keep them within a specified range.",
"CIColorControls": "Adjusts saturation, brightness, and contrast values.",
"CIColorCrossPolynomial": "Modifies the pixel values in an image by applying a set of polynomial cross-products.",
"CIColorCube": "Uses a three-dimensional color table to transform the source image pixels.",
"CIColorCubeWithColorSpace": "Uses a three-dimensional color table to transform the source image pixels and maps the result to a specified color space.",
"CIColorDodgeBlendMode": "Brightens the background image samples to reflect the source image samples.",
"CIColorInvert": "Inverts the colors in an image.",
"CIColorMap": "Performs a nonlinear transformation of source color values using mapping values provided in a table.",
"CIColorMatrix": "Multiplies source color values and adds a bias factor to each color component.",
"CIColorMonochrome": "Remaps colors so they fall within shades of a single color.",
"CIColorPolynomial": "Modifies the pixel values in an image by applying a set of cubic polynomials.",
"CIColorPosterize": "Remaps red, green, and blue color components to the number of brightness values you specify for each color component.",
"CIColumnAverage": "Returns a 1-pixel high image that contains the average color for each scan column.",
"CIComicEffect": "Simulates a comic book drawing by outlining edges and applying a color halftone effect.",
"CIConstantColorGenerator": "Generates a solid color.",
"CIConvolution3X3": "Modifies pixel values by performing a 3x3 matrix convolution.",
"CIConvolution5X5": "Modifies pixel values by performing a 5x5 matrix convolution.",
"CIConvolution7X7": "Modifies pixel values by performing a 7x7 matrix convolution.",
"CIConvolution9Horizontal": "Modifies pixel values by performing a 9-element horizontal convolution.",
"CIConvolution9Vertical": "Modifies pixel values by performing a 9-element vertical convolution.",
"CICopyMachineTransition": "Transitions from one image to another by simulating the effect of a copy machine.",
"CICrop": "Applies a crop to an image.",
"CICrystallize": "Creates polygon-shaped color blocks by aggregating source pixel-color values.",
"CIDarkenBlendMode": "Creates composite image samples by choosing the darker samples (from either the source image or the background).",
"CIDepthOfField": "Simulates a depth of field effect.",
"CIDifferenceBlendMode": "Subtracts either the source image sample color from the background image sample color, or the reverse, depending on which sample has the greater brightness value.",
"CIDiscBlur": "Blurs an image using a disc-shaped convolution kernel.",
"CIDisintegrateWithMaskTransition": "Transitions from one image to another using the shape defined by a mask.",
"CIDisplacementDistortion": "Applies the grayscale values of the second image to the first image.",
"CIDissolveTransition": "Uses a dissolve to transition from one image to another.",
"CIDivideBlendMode": "Divides the background image sample color from the source image sample color.",
"CIDotScreen": "Simulates the dot patterns of a halftone screen.",
"CIDroste": "Recursively draws a portion of an image in imitation of an M. C. Escher drawing.",
"CIEdges": "Finds all edges in an image and displays them in color.",
"CIEdgeWork": "Produces a stylized black-and-white rendition of an image that looks similar to a woodblock cutout.",
"CIEightfoldReflectedTile": "Produces a tiled image from a source image by applying an 8-way reflected symmetry.",
"CIExclusionBlendMode": "Produces an effect similar to that produced by the CIDifferenceBlendMode filter but with lower contrast.",
"CIExposureAdjust": "Adjusts the exposure setting for an image similar to the way you control exposure for a camera when you change the F-stop.",
"CIFalseColor": "Maps luminance to a color ramp of two colors.",
"CIFlashTransition": "Transitions from one image to another by creating a flash.",
"CIFourfoldReflectedTile": "Produces a tiled image from a source image by applying a 4-way reflected symmetry.",
"CIFourfoldRotatedTile": "Produces a tiled image from a source image by rotating the source image at increments of 90 degrees.",
"CIFourfoldTranslatedTile": "Produces a tiled image from a source image by applying 4 translation operations.",
"CIGammaAdjust": "Adjusts midtone brightness.",
"CIGaussianBlur": "Spreads source pixels by an amount specified by a Gaussian distribution.",
"CIGaussianGradient": "Generates a gradient that varies from one color to another using a Gaussian distribution.",
"CIGlassDistortion": "Distorts an image by applying a glass-like texture.",
"CIGlassLozenge": "Creates a lozenge-shaped lens and distorts the portion of the image over which the lens is placed.",
"CIGlideReflectedTile": "Produces a tiled image from a source image by translating and smearing the image.",
"CIGloom": "Dulls the highlights of an image.",
"CIHardLightBlendMode": "Either multiplies or screens colors, depending on the source image sample color.",
"CIHatchedScreen": "Simulates the hatched pattern of a halftone screen.",
"CIHeightFieldFromMask": "Produces a continuous three-dimensional, loft-shaped height field from a grayscale mask.",
"CIHexagonalPixellate": "Maps an image to colored hexagons whose color is defined by the replaced pixels.",
"CIHighlightShadowAdjust": "Adjust the tonal mapping of an image while preserving spatial detail.",
"CIHistogramDisplayFilter": "Generates a histogram image from the output of the CIAreaHistogram filter.",
"CIHoleDistortion": "Creates a circular area that pushes the image pixels outward, distorting those pixels closest to the circle the most.",
"CIHueAdjust": "Changes the overall hue, or tint, of the source pixels.",
"CIHueBlendMode": "Uses the luminance and saturation values of the background image with the hue of the input image.",
"CIKaleidoscope": "Produces a kaleidoscopic image from a source image by applying 12-way symmetry.",
"CILanczosScaleTransform": "Produces a high-quality, scaled version of a source image.",
"CILenticularHaloGenerator": "Simulates a lens flare.",
"CILightenBlendMode": "Creates composite image samples by choosing the lighter samples (either from the source image or the background).",
"CILightTunnel": "Rotates a portion of the input image specified by the center and radius parameters to give a tunneling effect.",
"CILinearBurnBlendMode": "Darkens the background image samples to reflect the source image samples while also increasing contrast.",
"CILinearDodgeBlendMode": "Brightens the background image samples to reflect the source image samples while also increasing contrast.",
"CILinearGradient": "Generates a gradient that varies along a linear axis between two defined endpoints.",
"CILinearToSRGBToneCurve": "Maps color intensity from a linear gamma curve to the sRGB color space.",
"CILineOverlay": "Creates a sketch that outlines the edges of an image in black.",
"CILineScreen": "Simulates the line pattern of a halftone screen.",
"CILuminosityBlendMode": "Uses the hue and saturation of the background image with the luminance of the input image.",
"CIMaskedVariableBlur": "Blurs the source image according to the brightness levels in a mask image.",
"CIMaskToAlpha": "Converts a grayscale image to a white image that is masked by alpha.",
"CIMaximumComponent": "Returns a grayscale image from max(r,g,b).",
"CIMaximumCompositing": "Computes the maximum value, by color component, of two input images and creates an output image using the maximum values.",
"CIMedianFilter": "Computes the median value for a group of neighboring pixels and replaces each pixel value with the median.",
"CIMinimumComponent": "Returns a grayscale image from min(r,g,b).",
"CIMinimumCompositing": "Computes the minimum value, by color component, of two input images and creates an output image using the minimum values.",
"CIModTransition": "Transitions from one image to another by revealing the target image through irregularly shaped holes.",
"CIMotionBlur": "Blurs an image to simulate the effect of using a camera that moves a specified angle and distance while capturing the image.",
"CIMultiplyBlendMode": "Multiplies the input image samples with the background image samples.",
"CIMultiplyCompositing": "Multiplies the color component of two input images and creates an output image using the multiplied values.",
"CINoiseReduction": "Reduces noise using a threshold value to define what is considered noise.",
"CIOpTile": "Segments an image, applying any specified scaling and rotation, and then assembles the image again to give an op art appearance.",
"CIOverlayBlendMode": "Either multiplies or screens the input image samples with the background image samples, depending on the background color.",
"CIPageCurlTransition": "Transitions from one image to another by simulating a curling page, revealing the new image as the page curls.",
"CIPageCurlWithShadowTransition": "Transitions from one image to another by simulating a curling page, revealing the new image as the page curls.",
"CIParallelogramTile": "Warps an image by reflecting it in a parallelogram, and then tiles the result.",
"CIPDF417BarcodeGenerator": "Generates a PDF417 code (two-dimensional barcode) from input data.",
"CIPerspectiveCorrection": "Applies a perspective correction, transforming an arbitrary quadrilateral region in the source image to a rectangular output image.",
"CIPerspectiveTile": "Applies a perspective transform to an image and then tiles the result.",
"CIPerspectiveTransform": "Alters the geometry of an image to simulate the observer changing viewing position.",
"CIPerspectiveTransformWithExtent": "Alters the geometry of a portion of an image to simulate the observer changing viewing position.",
"CIPhotoEffectChrome": "Applies a preconfigured set of effects that imitate vintage photography film with exaggerated color.",
"CIPhotoEffectFade": "Applies a preconfigured set of effects that imitate vintage photography film with diminished color.",
"CIPhotoEffectInstant": "Applies a preconfigured set of effects that imitate vintage photography film with distorted colors.",
"CIPhotoEffectMono": "Applies a preconfigured set of effects that imitate black-and-white photography film with low contrast.",
"CIPhotoEffectNoir": "Applies a preconfigured set of effects that imitate black-and-white photography film with exaggerated contrast.",
"CIPhotoEffectProcess": "Applies a preconfigured set of effects that imitate vintage photography film with emphasized cool colors.",
"CIPhotoEffectTonal": "Applies a preconfigured set of effects that imitate black-and-white photography film without significantly altering contrast.",
"CIPhotoEffectTransfer": "Applies a preconfigured set of effects that imitate vintage photography film with emphasized warm colors.",
"CIPinchDistortion": "Creates a rectangular area that pinches source pixels inward, distorting those pixels closest to the rectangle the most.",
"CIPinLightBlendMode": "Conditionally replaces background image samples with source image samples depending on the brightness of the source image samples.",
"CIPixellate": "Makes an image blocky by mapping the image to colored squares whose color is defined by the replaced pixels.",
"CIPointillize": "Renders the source image in a pointillistic style.",
"CIQRCodeGenerator": "Generates a Quick Response code (two-dimensional barcode) from input data.",
"CIRadialGradient": "Generates a gradient that varies radially between two circles having the same center.",
"CIRandomGenerator": "Generates an image of infinite extent whose pixel values are made up of four independent, uniformly-distributed random numbers in the 0 to 1 range.",
"CIRippleTransition": "Transitions from one image to another by creating a circular wave that expands from the center point, revealing the new image in the wake of the wave.",
"CIRowAverage": "Returns a 1-pixel high image that contains the average color for each scan row.",
"CISaturationBlendMode": "Uses the luminance and hue values of the background image with the saturation of the input image.",
"CIScreenBlendMode": "Multiplies the inverse of the input image samples with the inverse of the background image samples.",
"CISepiaTone": "Maps the colors of an image to various shades of brown.",
"CIShadedMaterial": "Produces a shaded image from a height field.",
"CISharpenLuminance": "Increases image detail by sharpening.",
"CISixfoldReflectedTile": "Produces a tiled image from a source image by applying a 6-way reflected symmetry.",
"CISixfoldRotatedTile": "Produces a tiled image from a source image by rotating the source image at increments of 60 degrees.",
"CISmoothLinearGradient": "Generates a gradient that uses an S-curve function to blend colors along a linear axis between two defined endpoints.",
"CISoftLightBlendMode": "Either darkens or lightens colors, depending on the input image sample color.",
"CISourceAtopCompositing": "Places the input image over the background image, then uses the luminance of the background image to determine what to show.",
"CISourceInCompositing": "Uses the background image to define what to leave in the input image, effectively cropping the input image.",
"CISourceOutCompositing": "Uses the background image to define what to take out of the input image.",
"CISourceOverCompositing": "Places the input image over the input background image.",
"CISpotColor": "Replaces one or more color ranges with spot colors.",
"CISpotLight": "Applies a directional spotlight effect to an image.",
"CISRGBToneCurveToLinear": "Maps color intensity from the sRGB color space to a linear gamma curve.",
"CIStarShineGenerator": "Generates a starburst pattern that is similar to a supernova; can be used to simulate a lens flare.",
"CIStraightenFilter": "Rotates the source image by the specified angle in radians.",
"CIStretchCrop": "Distorts an image by stretching and or cropping it to fit a target size.",
"CIStripesGenerator": "Generates a stripe pattern.",
"CISubtractBlendMode": "Subtracts the background image sample color from the source image sample color.",
"CISunbeamsGenerator": "Generates a sun effect.",
"CISwipeTransition": "Transitions from one image to another by simulating a swiping action.",
"CITemperatureAndTint": "Adapts the reference white point for an image.",
"CIToneCurve": "Adjusts tone response of the R, G, and B channels of an image.",
"CITorusLensDistortion": "Creates a torus-shaped lens and distorts the portion of the image over which the lens is placed.",
"CITriangleKaleidoscope": "Maps a triangular portion of an input image to create a kaleidoscope effect.",
"CITriangleTile": "Maps a triangular portion of image to a triangular area and then tiles the result.",
"CITwelvefoldReflectedTile": "Produces a tiled image from a source image by rotating the source image at increments of 30 degrees.",
"CITwirlDistortion": "Rotates pixels around a point to give a twirling effect.",
"CIUnsharpMask": "Increases the contrast of the edges between pixels of different colors in an image.",
"CIVibrance": "Adjusts the saturation of an image while keeping pleasing skin tones.",
"CIVignette": "Reduces the brightness of an image at the periphery.",
"CIVignetteEffect": "Modifies the brightness of an image around the periphery of a specified region.",
"CIVortexDistortion": "Rotates pixels around a point to simulate a vortex.",
"CIWhitePointAdjust": "Adjusts the reference white point for an image and maps all colors in the source using the new reference.",
"CIZoomBlur": "Simulates the effect of zooming the camera while capturing the image."
}
