{
	"CIBokehBlur" : {
		"softness" : "The softness of the bokeh effect"
	},
	"CIDepthBlurEffect" : {
		"_NOTE" : "THIS WAS GLEANED FROM WWDC2017#508 VIDEO; NO OFFICIAL APPLE DOCUMENTATION FOUND",
		"aperture" : "Simulated lens aperature to adjust blur for unfocused elements",
		"auxDataMetadata" : "UNKNOWN",
		"calibrationData" : "UNKNOWN",
		"chinPositions" : "Vector of up to 4 x,y positions indicating where peoples' chins are",
		"disparityImage" : "Grayscale image indicating depth; lighter is nearer.",
		"focusRectangle" : "Part of the rectangle to make sure to put into focus",
		"gainMap" : "UNKNOWN",
		"leftEyePositions" : "Vector of up to 4 x,y positions indicating where peoples' left eyes are",
		"lumaNoiseScale" : "UNKNOWN",
		"nosePositions" : "Vector of up to 4 x,y positions indicating where peoples' noses are",
		"rightEyePositions" : "Vector of up to 4 x,y positions indicating where peoples' right eyes are",
		"scaleFactor" : "Integrated downsampling (rather than doing it later) since this is computationally expensive",
		"shape" : "UNKNOWN"
	},
	"CIDepthOfField" : {
		"point0" : "A set of coordinates marking the first point to be focused on",
		"point1" : "A set of coordinates marking the second point to be focused on",
		"unsharpMaskIntensity" : "The intensity of the unsharp mask effect",
		"unsharpMaskRadius" : "The radius of the unsharpened mask effect applied to the in-focus area of effect"
	},
	"CIDroste" : {
		"insetPoint0" : "The x and y position that defines the first inset point",
		"insetPoint1" : "The x and y position that defines the second inset point",
		"periodicity" : "The amount of intervals",
		"rotation" : "The angle of the rotation, in radians",
		"strands" : "The amount of strands",
		"zoom" : "The zoom of the effect"
	},
	"CIEdgePreserveUpsampleFilter" : {
		"lumaSigma" : "Influence of the input image’s luma information on the upsampling operation",
		"smallImage" : "An image representing the reference for scaling the input image with the type CIImage",
		"spatialSigma" : "The influence of the input image’s spatial information on the upsampling operation"
	},
	"CIGuidedFilter" : {
		"_NOTE" : "THIS WAS GLEANED FROM DESCRIPTIONS OF THIS FILTER IN GENERAL; NO OFFICIAL APPLE DOCUMENTATION FOUND",
		"epsilon" : "Smoothness. A higher value means more smoothing."
	},
	"CIHueSaturationValueGradient" : {
		"dither" : "A boolean value specifying whether the distort the generated output",
		"softness" : "A float representing the softness of the generated color wheel"
	},
	"CILenticularHaloGenerator" : {
		"haloOverlap" : "A float representing the overlap of red, green, and blue halos. A value of 1 results in a full overlap."
	},
	"CIToneCurve" : {
		"point0" : "A vector containing the position of the first point of the tone curve",
		"point1" : "A vector containing the position of the second point of the tone curve",
		"point2" : "A vector containing the position of the third point of the tone curve",
		"point3" : "A vector containing the position of the fourth point of the tone curve",
		"point4" : "A vector containing the position of the fifth point of the tone curve"
	}
}
